apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
#include "app_nus_server.h"

#include "app_timer.h"
#include "app_uart.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "fds.h"
#include "filesystem.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "variables.h"
#include "filesystem.h"

static void write_time_to_flash(valor_type_t valor_type, uint32_t valor)
{
	uint16_t record_key =
		(valor_type == TIEMPO_ENCENDIDO) ? TIME_ON_RECORD_KEY : TIME_SLEEP_RECORD_KEY;
	fds_record_t record = {
		.file_id = TIME_FILE_ID, .key = record_key, .data.p_data = &valor, .data.length_words = 1};
	fds_record_desc_t record_desc;
	fds_find_token_t ftok = {0};
	ret_code_t err_code = fds_record_find(TIME_FILE_ID, record_key, &record_desc, &ftok);

	if(err_code == NRF_SUCCESS)
	{
		err_code = fds_record_update(&record_desc, &record);
		NRF_LOG_RAW_INFO("\n> Tiempo de %s %s: %d segundos.",
						 (valor_type == TIEMPO_ENCENDIDO) ? "encendido" : "sleep",
						 (err_code == NRF_SUCCESS) ? "actualizado" : "falló al actualizar",
						 valor / 1000);
	}
	else if(err_code == FDS_ERR_NOT_FOUND)
	{
		err_code = fds_record_write(&record_desc, &record);
		NRF_LOG_RAW_INFO("\nTiempo de %s %s: %d segundos.\n",
						 (valor_type == TIEMPO_ENCENDIDO) ? "encendido" : "sleep",
						 (err_code == NRF_SUCCESS) ? "guardado" : "falló al guardar",
						 valor / 1000);
	}
	else
	{
		NRF_LOG_ERROR("Error al buscar el registro en memoria flash: %d", err_code);
	}
}

uint32_t read_time_from_flash(valor_type_t valor_type, uint32_t default_valor)
{
	fds_flash_record_t flash_record;
	fds_record_desc_t record_desc;
	fds_find_token_t ftok = {0}; // Importante inicializar a cero
	uint32_t resultado = default_valor;
	uint32_t* data;
	uint16_t record_key;
	ret_code_t err_code;
	// Determinar el Record Key según el tipo de valor
	record_key = (valor_type == TIEMPO_ENCENDIDO) ? TIME_ON_RECORD_KEY : TIME_SLEEP_RECORD_KEY;

	// Busca el registro en la memoria flash
	err_code = fds_record_find(TIME_FILE_ID, record_key, &record_desc, &ftok);

	if(err_code == NRF_SUCCESS)
	{
		// Si el registro existe, abre y lee el valor
		err_code = fds_record_open(&record_desc, &flash_record);
		if(err_code == NRF_SUCCESS)
		{
			// Verifica que el tamaño del dato leído sea el esperado
			if(flash_record.p_header->length_words == 1)
			{
				// Copiar directamente el valor desde flash
				data = (uint32_t*)flash_record.p_data;
				resultado = *data;
				NRF_LOG_RAW_INFO("\n\t>> Tiempo de %s cargado: %u ms",
								 (valor_type == TIEMPO_ENCENDIDO) ? "encendido" : "sleep",
								 resultado);
			}
			else
			{
				NRF_LOG_RAW_INFO("\n\t>> Tamaño del dato en memoria flash no coincide con "
								 "el "
								 "esperado.\n");
			}

			err_code = fds_record_close(&record_desc);
			if(err_code != NRF_SUCCESS)
			{
				NRF_LOG_RAW_INFO("\n\t>> Error al cerrar el registro: 0x%X", err_code);
				return default_valor;
			}
		}
		else
		{
			NRF_LOG_RAW_INFO("\n\t>> Error al abrir el registro: 0x%X", err_code);
		}
	}
	else
	{
		NRF_LOG_RAW_INFO("\n\t>> Registro no encontrado. Usando valor predeterminado: %u\n",
						 default_valor);
	}

	return resultado;
}

#define APP_BLE_CONN_CFG_TAG 1

#define DEVICE_NAME                                                                                \
	"Repetidor" /**< Name of device. Will be included in the advertising data. \
                 */
#define NUS_SERVICE_UUID_TYPE                                                                      \
	BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service      \
                                  (vendor specific). */

#define APP_BLE_OBSERVER_PRIO                                                                      \
	3 /**< Application's BLE observer priority. You shouldn't need to modify   \
         this value. */

#define APP_ADV_INTERVAL                                                                           \
	64 /**< The advertising interval (in units of 0.625 ms. This value         \
          corresponds to 40 ms). */

#define APP_ADV_DURATION                                                                           \
	18000 /**< The advertising duration (180 seconds) in units of 10           \
             milliseconds. */
#define MIN_CONN_INTERVAL                                                                          \
	MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Minimum acceptable connection interval (20 ms),     \
                         Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                                                                          \
	MSEC_TO_UNITS(75, UNIT_1_25_MS) /**< Maximum acceptable connection interval (75 ms),   \
                           Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY 0 /**< Slave latency. */
#define CONN_SUP_TIMEOUT                                                                           \
	MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Connection supervisory timeout (4 seconds), \
                                 Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY                                                             \
	APP_TIMER_TICKS(5000) /**< Time from initiating event (connect or start of             \
                 notification) to first time sd_ble_gap_conn_param_update is   \
                 called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                                                              \
	APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update     \
                  after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT                                                               \
	3 /**< Number of attempts before giving up the connection parameter        \
         negotiation. */

#define DEAD_BEEF                                                                                  \
	0xDEADBEEF /**< Value used as error code on stack dump, can be used to     \
                  identify stack location on stack unwind. */

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT); /**< BLE NUS service instance. */
NRF_BLE_QWR_DEF(m_qwr); /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; // Handle del celular
static uint16_t m_emisor_conn_handle = BLE_CONN_HANDLE_INVALID; // Handle del emisor
static uint8_t custom_mac_addr_[6] = {0}; // Arreglo de 6 bytes para la MAC
static ble_gap_addr_t m_target_periph_addr; // No const, se inicializa en tiempo de ejecución
static uint8_t mac_address_from_flash[6] = {0}; // Arreglo de 6 bytes para la MAC
static uint16_t m_ble_nus_max_data_len =
	BLE_GATT_ATT_MTU_DEFAULT -
	3; /**< Maximum length of data (in bytes) that can be transmitted to the
          peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifier. */
	{{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};

