apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
	// Initialize Queued Write Module.
	qwr_init.error_handler = nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	// Initialize NUS.
	memset(&nus_init, 0, sizeof(nus_init));

	nus_init.data_handler = nus_data_handler;

	err_code = ble_nus_init(&m_nus, &nus_init);
	APP_ERROR_CHECK(err_code);
}

static void on_conn_params_evt(ble_conn_params_evt_t* p_evt)
{
	uint32_t err_code;

	if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
	{
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}

static void conn_params_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}

static void conn_params_init(void)
{
	uint32_t err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail = true;
	cp_init.evt_handler = on_conn_params_evt;
	cp_init.error_handler = conn_params_error_handler;

	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}

static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
	uint32_t err_code;

	switch(ble_adv_evt)
	{
	case BLE_ADV_EVT_FAST:
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
		APP_ERROR_CHECK(err_code);
		break;
	case BLE_ADV_EVT_IDLE:
		// sleep_mode_enter();
		break;
	default:
		break;
	}
}

void app_nus_server_ble_evt_handler(ble_evt_t const* p_ble_evt)
{
	uint32_t err_code;
	ble_gap_evt_t const* p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch(p_ble_evt->header.evt_id)
	{
	case BLE_GAP_EVT_CONNECTED:
		if(p_gap_evt->params.connected.role == BLE_GAP_ROLE_PERIPH)
		{
			NRF_LOG_RAW_INFO("\nCelular conectado");
			m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle; // Guardar handle del celular
		}
		else if(p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
		{
			NRF_LOG_RAW_INFO("\nEmisor conectado");
			m_emisor_conn_handle = p_ble_evt->evt.gap_evt.conn_handle; // Guardar handle del emisor
		}
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		if(p_gap_evt->conn_handle == m_conn_handle)
		{
			NRF_LOG_RAW_INFO("\nCelular desconectado\n");
			m_conn_handle = BLE_CONN_HANDLE_INVALID; // Invalida el handle del celular
		}
		else if(p_gap_evt->conn_handle == m_emisor_conn_handle)
		{
			NRF_LOG_RAW_INFO("\nEmisor desconectado");
			NRF_LOG_RAW_INFO("\n\nBuscando emisor...\n");

			m_emisor_conn_handle = BLE_CONN_HANDLE_INVALID; // Invalida el handle del emisor
		}
		break;

	case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
		NRF_LOG_DEBUG("PHY update request.");
		ble_gap_phys_t const phys = {
			.rx_phys = BLE_GAP_PHY_AUTO,
			.tx_phys = BLE_GAP_PHY_AUTO,
		};
		err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
		APP_ERROR_CHECK(err_code);
	}
	break;

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		// Pairing not supported
		err_code = sd_ble_gap_sec_params_reply(
			m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_SYS_ATTR_MISSING:
		// No system attributes have been stored.
		err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
										 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
										 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	default:
		// No implementation needed.
		break;
	}
}

uint32_t app_nus_server_send_data(const uint8_t* data_array, uint16_t length)
{
	return ble_nus_data_send(&m_nus, (uint8_t*)data_array, &length, m_conn_handle);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
	uint32_t err_code;
	ble_advertising_init_t init;

	memset(&init, 0, sizeof(init));

	init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = false;
	init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

	init.config.ble_adv_on_disconnect_disabled = true;

	init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	init.srdata.uuids_complete.p_uuids = m_adv_uuids;

	init.config.ble_adv_fast_enabled = true;
	init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
	init.config.ble_adv_fast_timeout = APP_ADV_DURATION;
	init.evt_handler = on_adv_evt;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
	uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
}

void advertising_stop(void)
{
	sd_ble_gap_adv_stop(m_advertising.adv_handle);
}

void disconnect_all_connections(void)
{
	ret_code_t err_code;

	if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
	{
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		m_conn_handle = BLE_CONN_HANDLE_INVALID;
		NRF_LOG_RAW_INFO("\nCelular desconectado.");
	}
}

void app_nus_server_init(app_nus_server_on_data_received_t on_data_received)
{
	m_on_data_received = on_data_received;
	gap_params_init();
	services_init();
	advertising_init();
	conn_params_init();
	fds_initialize();
	advertising_start();
}
